@rohit-myali : I have tried upgrading to 1.39.0 provider but for every terraform apply the provider now wants to replace the signatures on each run.. The provider seems to belive it is changed on each run as follows

# module.netscaler-adc-waf-fqdn_company_no.citrixadc_appfwsignatures.app_waf must be replaced
-/+ resource "citrixadc_appfwsignatures" "app_waf" {
      + action                  = (known after apply) # forces replacement
      + autoenablenewsignatures = (known after apply)
      + category                = (known after apply)
      + enabled                 = (known after apply)
      ~ id                      = "waf_sig_fqdn.company.no" -> (known after apply)
      + mergedefault            = (known after apply)
        name                    = "waf_sig_fqdn.company.no"
      + ruleid                  = (known after apply) # forces replacement
      + sha1                    = (known after apply)
      + vendortype              = (known after apply)
      + xslt                    = (known after apply)
        # (5 unchanged attributes hidden)
    }
